Конфигурация/Documents/РегистрацияПрофсуждений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РегистрацияПрофсуждений</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОбесценениеАктивов</xr:Item>
				<xr:Item>InformationRegister.ОценкиСтоимостиПрочихАктивов</xr:Item>
				<xr:Item>InformationRegister.ОценкиСтоимостиЦенныхБумаг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оценщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаОценки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОценки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтоимостьЦенныхБумаг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Рынок</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПовышенныйПриоритет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИсточникиЦеныДляПереоценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньОценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсВалютыНоминала</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаКупона</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаЦены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаСтадииОбесценения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтадияОбесценения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтадииОбесценения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаКредитногоРиска</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PD</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЭффективнаяПроцентнаяСтавка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаКредитногоРискаLGD</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LGD</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЭффективнаяПроцентнаяСтавка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PDLifeTime</Name>
							<Comment>PD Lifetime или обычный</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Обесценение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Актив</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.АктивДляОбесценения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДенежногоПотока</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>10</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтоимостьПрочихАктивов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАктива</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубъектАналитики</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СубъектыАналитики</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеСтоимостиАктивов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтадияОбесценения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтадииОбесценения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаСтадииОбесценения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/РегистрацияПрофсуждений/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
	Если Объект.СтоимостьЦенныхБумаг.Количество()>0 Тогда
		ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаЦенныеБумаги;
	ИначеЕсли Объект.Обесценение.Количество()>0 Тогда
		ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаОбесценение;
	ИначеЕсли Объект.СтоимостьПрочихАктивов.Количество()>0 Тогда
		ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаПрочиеАктивы;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ЗаполнитьВалютыЦенныхБумаг(); // после записи теряются значения реквизитов, добавленных к т.ч. объекта	
	
	ЗаполнитьLGDПредставление(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	ДатаОценкиПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Элементы.ЦенныеБумагиЦеннаяБумага.ОграничениеТипа  = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(ТекущиеДанные.Рынок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиРынокПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	Элементы.ЦенныеБумагиЦеннаяБумага.ОграничениеТипа  = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(ТекущиеДанные.Рынок);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиЦеннаяБумагаПриИзменении(Элемент)
	
	ЗаполнитьВалютыЦенныхБумаг("СтоимостьЦенныхБумаг", Элементы.ЦенныеБумаги.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиОценкаЦеныПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.ОценкаЦены Тогда
		ТекущиеДанные.Стоимость		= Неопределено;
		ТекущиеДанные.ВидЦены		= Неопределено;
		ТекущиеДанные.УровеньОценки	= Неопределено;
		ТекущиеДанные.Источник		= Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиОценкаКупонаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.ОценкаКупона Тогда
		ТекущиеДанные.СтоимостьКупона = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиОценкаСтадииОбесцененияПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.ОценкаСтадииОбесценения Тогда
		ТекущиеДанные.СтадияОбесценения = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьПрочихАктивовОценкаСтадииОбесцененияПриИзменении(Элемент)

	ТекущиеДанные = Элементы.СтоимостьПрочихАктивов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.ОценкаСтадииОбесценения Тогда
		ТекущиеДанные.СтадияОбесценения = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ЗаполнитьВалютыЦенныхБумаг();	
	
	ЭтаФорма.ВидОценки = РеквизитФормыВЗначение("Объект").ОпределитьВидИсточникаЦены();
	Если ЭтаФорма.ВидОценки = 0 Тогда
		ЭтаФорма.ВидОценки = 3;	
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	ЗаполнитьLGDПредставление(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВалютыЦенныхБумаг(ИмяТабличнойЧасти = "СтоимостьЦенныхБумаг", ТекущаяСтрока = Неопределено)
	
	Строки = Неопределено;
	Если ТекущаяСтрока <> Неопределено Тогда
		Строки = Новый Массив;
		Строки.Добавить(Объект[ИмяТабличнойЧасти].НайтиПоИдентификатору(ТекущаяСтрока));
	КонецЕсли;
	
	ИсходнаяТаблица		= Объект[ИмяТабличнойЧасти].Выгрузить(Строки);
	ВыгружаемыеКолонки	= РаботаСКоллекциями.ПолучитьПоляТаблицыДляЗапроса(ИсходнаяТаблица, "_ИсходнаяТаблица", "ВалютаНоминала, ВалютаУчета"); 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	*
		|ПОМЕСТИТЬ _ИсходнаяТаблица
		|ИЗ
		|	&ИсходнаяТаблица КАК _ИсходнаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИсходнаяТаблица.*,
		|	ЕСТЬNULL(Акции.ВалютаНоминала,
		|		ЕСТЬNULL(Облигации.ВалютаНоминала,
		|			ЕСТЬNULL(Паи.ВалютаНоминала,
		|				ЕСТЬNULL(Векселя.ВалютаНоминала,
		|					ЕСТЬNULL(ПроизводныеФинансовыеИнструменты.Валюта,
		|						ЕСТЬNULL(ДепозитарныеРасписки.ВалютаНоминала,
		|							ЕСТЬNULL(ИпотечныеСертификатыУчастия.ВалютаНоминала,
		|								ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)))))))) КАК ВалютаНоминала,
		|	&ВалютаУчета КАК ВалютаУчета
		|ИЗ
		|	_ИсходнаяТаблица КАК _ИсходнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Акции КАК Акции
		|		ПО (Акции.Ссылка = _ИсходнаяТаблица.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО (Облигации.Ссылка = _ИсходнаяТаблица.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Паи КАК Паи
		|		ПО (Паи.Ссылка = _ИсходнаяТаблица.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Векселя КАК Векселя
		|		ПО (Векселя.Ссылка = _ИсходнаяТаблица.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроизводныеФинансовыеИнструменты КАК ПроизводныеФинансовыеИнструменты
		|		ПО (ПроизводныеФинансовыеИнструменты.Ссылка = _ИсходнаяТаблица.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитарныеРасписки КАК ДепозитарныеРасписки
		|		ПО (ДепозитарныеРасписки.Ссылка = _ИсходнаяТаблица.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИпотечныеСертификатыУчастия КАК ИпотечныеСертификатыУчастия
		|		ПО (ИпотечныеСертификатыУчастия.Ссылка = _ИсходнаяТаблица.ЦеннаяБумага)
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ИсходнаяТаблица.НомерСтроки";
	Запрос.УстановитьПараметр("ИсходнаяТаблица", ИсходнаяТаблица);
	Запрос.УстановитьПараметр("ВалютаУчета", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ВалютаУчета"));	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "_ИсходнаяТаблица.*", ВыгружаемыеКолонки);	
	
	ДополненнаяТаблица = Запрос.Выполнить().Выгрузить();		
	Если Строки = Неопределено Тогда
		Объект[ИмяТабличнойЧасти].Загрузить(ДополненнаяТаблица);
	ИначеЕсли Строки.Количество() = ДополненнаяТаблица.Количество() Тогда
		ЗаполнитьЗначенияСвойств(Строки[0], ДополненнаяТаблица[0]);   
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	Элементы      = Форма.Элементы;
	
	ЭтоОтчетОценщика = Форма.ВидОценки = 3;
	Элементы.НомерДокументаОценки.Видимость = ЭтоОтчетОценщика;
	Элементы.ДатаОтчетаОценщика.Видимость = ЭтоОтчетОценщика;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ВидОценкиПриИзменении(Элемент)
	
	УстановитьУстановитьИсточникПрофсуждения();	
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУстановитьИсточникПрофсуждения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА &ВидОценки = 1
		|			ТОГДА ВЫБОР
		|					КОГДА КлиентыДоверительногоУправленияСрезПоследних.Клиент ССЫЛКА Справочник.ЮрФизЛица
		|						ТОГДА КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|					ИНАЧЕ КлиентыДоверительногоУправленияСрезПоследних.Организация.ЮрФизЛицо
		|				КОНЕЦ
		|		КОГДА &ВидОценки = 2
		|			ТОГДА КлиентыДоверительногоУправленияСрезПоследних.Организация.ЮрФизЛицо
		|		КОГДА &ВидОценки = 3
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|	КОНЕЦ КАК Клиент
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&ДатаДокумента,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидОценки", ЭтаФорма.ВидОценки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Оценщик = ВыборкаДетальныеЗаписи.Клиент;
	КонецЦикла;
	
	Если ЭтаФорма.ВидОценки <> 3 Тогда
		Объект.НомерДокументаОценки = "";
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончанияДействия) Тогда
		ТекущиеДанные.ДатаОкончанияДействия = ПолучитьМаксимальнуюДатуДействия(ПредопределенноеЗначение("Перечисление.ВидыАктивов.ЦенныеБумаги"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМаксимальнуюДатуДействия(ВидАктива)
	
	Возврат Документы.РегистрацияПрофсуждений.ПолучитьМаксимальнуюДатуДействия(Объект, ВидАктива);
	
КонецФункции

&НаКлиенте
Процедура ДатаОценкиПриИзмененииНаСервере()
	
	Для Каждого Строка из Объект.СтоимостьЦенныхБумаг Цикл
		Строка.ДатаОкончанияДействия = ПолучитьМаксимальнуюДатуДействия(ПредопределенноеЗначение("Перечисление.ВидыАктивов.ЦенныеБумаги"));
	КонецЦикла;
	
	Для Каждого Строка из Объект.СтоимостьПрочихАктивов Цикл
		Строка.ДатаОкончанияДействия = ПолучитьМаксимальнуюДатуДействия(Строка.ВидАктива);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОценкиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаОценки)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") 
			=  ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда") Тогда
			
		Если Вопрос("Перезаполнить даты окончания действия?",РежимДиалогаВопрос.ДаНет,,,,) = КодВозвратаДиалога.Да Тогда
			ДатаОценкиПриИзмененииНаСервере();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипыСубъектаАналитикиИОснованияНаСервере(ВидАктива)
	
	Если ВидАктива = Перечисления.ВидыАктивов.Обеспечение Или ВидАктива = Перечисления.ВидыАктивов.Займы Тогда
		ЭтаФорма.Элементы.СтоимостьПрочихАктивовСубъектАналитики.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Займы");
		ЭтаФорма.Элементы.СтоимостьПрочихАктивовОснование.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Договоры");
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Основание", "Элементы.СтоимостьПрочихАктивов.ТекущиеДанные.СубъектАналитики");
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.СтоимостьПрочихАктивовОснование.СвязиПараметровВыбора = НовыеСвязи;
		
	ИначеЕсли ВидАктива = Перечисления.ВидыАктивов.Недвижимость Тогда			
		ЭтаФорма.Элементы.СтоимостьПрочихАктивовСубъектАналитики.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ОбъектыНедвижимости");
		ЭтаФорма.Элементы.СтоимостьПрочихАктивовОснование.ОграничениеТипа = Новый ОписаниеТипов("Неопределено");
		
		Элементы.СтоимостьПрочихАктивовОснование.СвязиПараметровВыбора =  Новый ФиксированныйМассив(Новый Массив())
		
	ИначеЕсли ВидАктива = Перечисления.ВидыАктивов.ИмущественныеПрава
		ИЛИ ВидАктива = Перечисления.ВидыАктивов.ПраваАренды Тогда			
		ЭтаФорма.Элементы.СтоимостьПрочихАктивовСубъектАналитики.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ОбъектыНедвижимости");
		ЭтаФорма.Элементы.СтоимостьПрочихАктивовОснование.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.СделкаСНедвижимостью");
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.СчетДоверительногоУправления", "Объект.СчетДоверительногоУправления");
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.СтоимостьПрочихАктивовОснование.СвязиПараметровВыбора = НовыеСвязи;
		
	КонецЕсли;
	
КонецПроцедуры
	

&НаКлиенте
Процедура УстановитьТипыСубъектаАналитикиИОснования()
	
	ТекущиеДанные = Элементы.СтоимостьПрочихАктивов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьТипыСубъектаАналитикиИОснованияНаСервере(ТекущиеДанные.ВидАктива);
	
КонецПроцедуры
	
&НаКлиенте
Процедура СтоимостьПрочихАктивовВидАктиваПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СтоимостьПрочихАктивов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ВидАктива) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ДатаОкончанияДействия = ПолучитьМаксимальнуюДатуДействия(ТекущиеДанные.ВидАктива);
	
	УстановитьТипыСубъектаАналитикиИОснования();
	
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьПрочихАктивовПередНачаломИзменения(Элемент, Отказ)
	УстановитьТипыСубъектаАналитикиИОснования();
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиОценкаКредитногоРискаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.ОценкаКредитногоРиска Тогда
		ТекущиеДанные.PD = Неопределено;
		ТекущиеДанные.PDLifeTime = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЦенныеБумагиОценкаКредитногоРискаLGDПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.ОценкаКредитногоРискаLGD Тогда
		ТекущиеДанные.LGD = Неопределено;
		ТекущиеДанные.LGDПредставление = Неопределено;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиLGDПредставлениеПриИзменении(Элемент)
	Элементы.ЦенныеБумаги.ТекущиеДанные.LGD  = Элементы.ЦенныеБумаги.ТекущиеДанные.LGDПредставление/100;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьLGDПредставление(Форма)
	
	Объект = Форма.Объект;
	
	Для Каждого СтрокаЦенныеБумаги Из Объект.СтоимостьЦенныхБумаг Цикл
		СтрокаЦенныеБумаги.LGDПредставление = СтрокаЦенныеБумаги.LGD * 100;	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
